{"timestamp": 1758375983.3193972, "content": {"success": true, "result": {"source_url": "https://www.artificialintelligence-news.com/news/nvidia-unveils-blackwell-architecture-power-next-genai-wave/", "article_text": "AI News is part of the TechForge Publications series\nTechForge\nAI Market Trends\nRyan Daws\nMarch 19, 2024\nShare this story:\nTags:\nCategories:\nNVIDIA has announced its next-generationBlackwellGPU architecture, designed to usher in a new era of accelerated computing and enable organisations to build and run real-time generative AI on trillion-parameter large language models.\nThe Blackwell platform promises up to 25 times lower cost and energy consumption compared to its predecessor: theHopperarchitecture. Named after pioneering mathematician and statistician David Harold Blackwell, the new GPU architecture introduces six transformative technologies.\n“Generative AI is the defining technology of our time. Blackwell is the engine to power this new industrial revolution,” said Jensen Huang, Founder and CEO of NVIDIA. “Working with the most dynamic companies in the world, we will realise the promise of AI for every industry.”\nThe key innovations in Blackwell include the world’s most powerful chip with 208 billion transistors, a second-generation Transformer Engine to support double the compute and model sizes, fifth-generation NVLink interconnect for high-speed multi-GPU communication, and advanced engines for reliability, security, and data decompression.\nCentral to Blackwell is the NVIDIA GB200 Grace Blackwell Superchip, which combines two B200 Tensor Core GPUs with a Grace CPU over an ultra-fast 900GB/s NVLink interconnect. Multiple GB200 Superchips can be combined into systems like the liquid-cooled GB200 NVL72 platform with up to 72 Blackwell GPUs and 36 Grace CPUs, offering 1.4 exaflops of AI performance.\nNVIDIA has already secured support from major cloud providers like Amazon Web Services, Google Cloud, Microsoft Azure, and Oracle Cloud Infrastructure to offer Blackwell-powered instances. Other partners planning Blackwell products include Dell Technologies, Meta, Microsoft, OpenAI, Oracle, Tesla, and many others across hardware, software, and sovereign clouds.\nSundar Pichai, CEO of Alphabet and Google, said: “We are fortunate to have a longstanding partnership with NVIDIA, and look forward to bringing the breakthrough capabilities of the Blackwell GPU to our Cloud customers and teams across Google to accelerate future discoveries.”\nThe Blackwell architecture and supporting software stack will enable new breakthroughs across industries from engineering and chip design to scientific computing and generative AI.\nMark Zuckerberg, Founder and CEO of Meta, commented: “AI already powers everything from our large language models to our content recommendations, ads, and safety systems, and it’s only going to get more important in the future.\n“We’re looking forward to using NVIDIA’s Blackwell to help train our open-source Llama models and build the next generation of Meta AI and consumer products.”\nWith its massive performance gains and efficiency, Blackwell could be the engine to finally make real-time trillion-parameter AI a reality for enterprises.\nSee also:Elon Musk’s xAI open-sources Grok\nWant to learn more about AI and big data from industry leaders?Check outAI & Big Data Expotaking place in Amsterdam, California, and London. The comprehensive event is co-located with other leading events includingBlockX,Digital Transformation Week, andCyber Security & Cloud Expo.\nExplore other upcoming enterprise technology events and webinars powered by TechForgehere.\nRyan Daws\nSenior Editor\nSeptember 19, 2025\nSeptember 19, 2025\nSeptember 19, 2025\nSeptember 18, 2025\nSubscribe now to get all our premium content and latest tech news delivered straight to your inbox\nArtificial Intelligence,How It Works,Inside AI,Utilities\nAI in Action,AI Market Trends,Artificial Intelligence\nArtificial Intelligence,Finance AI,Retail & Logistics AI\nArtificial Intelligence,Interviews,Natural Language Processing (NLP),World of Work\nInfrastructure & Hardware\nSeptember 18, 2025\nCybersecurity AI\nSeptember 17, 2025\nFinance AI\nSeptember 17, 2025\nAll our premium content and latest tech news delivered straight to your inbox\nAI News is part ofTechForge\nAll our premium content and latest tech news delivered straight to your inbox"}, "error": null, "resultType": "object"}}