{"timestamp": 1757752371.1499383, "content": "--- 新聞來源: https://www.bbc.com/news/articles/cz9je8lxge4o?at_medium=RSS&at_campaign=rss ---\n\nCharlie Kirk's widow, Erika, has given a tearful address in which she thanked first responders for trying to save her husband's life after he was fatally shot on a Utah university campus.\nIn a livestream, standing beside her husband's empty chair that he used during podcast tapings, she quoted the Bible and spoke about his love for President Donald Trump, Vice-President JD Vance, the United States and the couple's two children.\nKirk, a right-wing activist, was shot dead on Wednesday during an open-air speaking event in Orem, Utah. His suspected killer, Tyler Robinson, was arrested on Thursday night after surrendering to police.\nIn her remarks, Mrs Kirk pledged: \"My husband's voice will remain.\"\nThe broadcast from Turning Point USA's headquarters in Arizona began with several minutes of silence, as the camera framed Charlie Kirk's empty chair.\nAs his widow started speaking, she looked upwards and whispered a silent prayer.\nShe then thanked first responders who tried to save him, her husband's staff, and the White House.\n\"Mr President, my husband loved you. And he knew that you loved him too,\" she said tearfully, also thanking Vance and his wife Usha for accompanying the casket back to Arizona.\n\"But most of all, Charlie loved his children. And he loved me. With all his heart. And he made sure I knew that everyday.\"\nAddressing \"evil-doers\", Mrs Kirk said: \"You have no idea the fire that you have ignited within this wife, the cries of this widow will echo around the world like a battle cry.\n\"They should all know this: if you thought that my husband's mission was powerful before you have no idea, you have no idea what you just have unleashed across this entire country and this world.\"\nHer husband's tour of US university campuses will continue throughout the autumn, and in the years to come, she said, without offering further details. His podcast will also continue.\nMrs Kirk also spoke of their one-year-old son and three-year-old daughter, saying that she was at a loss for how to explain their father's sudden death.\n\"Baby, daddy loves you so much. Don't you worry. He's on a work trip with Jesus,\" she told their daughter.\nMrs Kirk, 36, and their children were reportedly in the audience when her husband was shot.\nErika Kirk is a businesswoman and former Miss Arizona USA winner, who met her husband in 2018. The couple were engaged by 2020 and wed less than a year later.\nShe is currently studying for a doctorate in Bible studies, has launched a ministry programme and hosts the Midweek Rise Up podcast focused on Biblical leadership. Mrs Kirk also acts and models, and has a faith-based clothing line.\nAlthough the children and the couple's home life are regular fixtures on her social media pages, they never publish images showing their children's faces.\nCharlie Kirk, 31, a controversial figure in US political discourse, had been hailed by many as the future of American conservatism with a knack forenergising young conservatives.\nBy mobilising the youth vote, he was an instrumental organiser in Trump's Maga coalition and helped return him to the White House for a second term.\nKirk was a strong supporter of gun rights, vehemently opposed abortion, was critical of transgender rights and promoted false claims about Covid-19.\nHis views were polarising on the college campuses, where he held large events, and his provocative speeches would draw crowds of vocal opponents as well as fans.\nKirk's supporters said he was relatable and understood their concerns. But his views drew fierce liberal criticism, with his detractors said his rhetoric hurt people - especially those in the LGBT community.\nKirk was speaking at Utah Valley University during Turning Point USA's The American Comeback Tour, a speaking engagement that took him to several college campuses throughout the US.\nHe was shot during his viral Prove Me Wrong debate while taking a question about gun violence and transgender people in the US.\nTrump has announced that he will award Kirk a posthumous Presidential Medal of Freedom - the highest civilian honour a president can bestow - describing his friend and ally as a \"giant of his generation and a champion of liberty\".\nThe US president said that Mrs Kirk \"is absolutely devastated\".\nTurning Point USA, the organisation Charlie Kirk founded when he was 18 years old, also referred to its co-founder as a \"martyr\" and \"pioneer\".\n\"Charlie was the ideal husband and the perfect father. Above all else, we ask you to pray for the Kirks after the incomprehensible loss they have suffered,\" the organisation said in a statement to the BBC on Thursday.\nJD Vance flew to Salt Lake City, Utah, on Thursday to retrieve Kirk's casket and transport it to Phoenix, Arizona - where Kirk's family lives - on the vice-presidential aircraft, Air Force Two.\nVance and Second Lady Usha Vance travelled with Kirk's family and some of his friends to Arizona.\n\n--- 新聞來源: https://www.bbc.com/news/articles/cly7417ge50o?at_medium=RSS&at_campaign=rss ---\n\nA 22-year-old from Utah has been arrested over the killing of right-wing activist Charlie Kirk, who was shot dead while on stage at a university event earlier this week.\nTyler Robinson was taken into custody late on Thursday, after a 33-hour manhunt  that ended after his father helped persuade him to surrender to police.\nHis arrest was first announced by US President Donald Trump, who called for the suspect to face the death penalty.\nThe killing of Kirk, who was shot while debating students on Wednesday, has shocked Americans and laid bare the country's sharp partisan divisions.\nInvestigators said at a news conference on Friday that the suspect had confessed to his father and said he would rather take his own life than surrender. The father then called a youth pastor who is a family friend.\nBoth men tried to calm the suspect down, police said. The pastor, who also serves as a court security officer, later called the US Marshals, who detained the suspect at around 22:00 local time on Thursday.\nUtah's Governor Spencer Cox said surveillance images showed Mr Robinson arriving on the campus of Utah Valley University around four hours before a shot rang out, killing Kirk and sending students running for cover.\nCox told journalists that when Mr Robinson was taken into custody, he was wearing clothing similar to what was seen on CCTV cameras at the scene of the shooting.\nThe governor added that investigators had interviewed a family member, who said the suspect had become more political in recent years.\nCox said the family member had spoken of a recent incident when Mr Robinson had mentioned that Kirk was coming to Utah and that he \"was full of hate and spreading hate\".\nCox said investigators had also spoken to a roommate of the suspect who had shown them exchanges of messages with an account named \"Tyler\" on the messaging app Discord.\nThe messages referred to a need to retrieve a rifle from \"a drop point\" and the firearm being left in a bush, wrapped in a towel.\nThe FBI said on Thursday that they had found the suspected weapon - an imported Mauser .30-06 bolt action rifle - wrapped in a towel in a wooded area near campus.\nCox told reporters that inscriptions had been found engraved on casings recovered with the rifle, which had a scope mounted on top of it.\nThe inscriptions included \"hey fascist! CATCH!\" and \"O Bella ciao, Bella ciao\".\n\"Bella ciao\" means \"goodbye beautiful\" in Italian. It is also the title of a song dedicated to the Italian resistance that fought against the occupying troops of Nazi Germany.\nUtah's governor said he was not aware of any potential further arrests in the investigation.\nState prosecutors said they planned to file formal charges against Mr Robinson on Tuesday.\nHe is accused of aggravated murder, obstruction of justice, and felony discharge of a firearm, according to a Utah County Sheriff inmate booking sheet obtained by the BBC.\nStudents at Utah Valley University told the BBC they were relieved to hear of the arrest.\nThe campus has been closed since the shooting on Wednesday afternoon - with yellow tape and police vehicles blocking much of the school.\n\"He was apprehended in Washington County, which is where I'm from,\" said first-year student McKinley Shinkle. \"I just feel deeply ashamed.\"\n\"I'm definitely relieved,\" added McKinley's cousin Anthony. \"I'm just anxious now to hear his motives and why this happened.\"\nPublic records viewed by the BBC suggest Mr Robinson had registered as an unaffiliated - or nonpartisan - voter in Utah in the past. Matthew Carl Robinson, the suspect's father, and Amber Denise Robinson, the suspect's mother, are registered Republicans, state records show.\nVoting records indicate that he did not vote in the last presidential election, according to CBS News, the BBC's US partner. He was not old enough to vote in 2020.\nThe suspect lives in St George, Utah, near Zion National Park, about 250 miles (400km) south-west of the campus where Kirk was shot.\nHe is a third-year student in an electrical apprenticeship programme at Dixie Technical College in south-west Utah, where he lived, a spokesperson for Utah Valley University (UVU) told the BBC.\nSocial media accounts indicate Mr Robinson's father runs a kitchen countertop and cabinet installation business, while his mother is a social worker. The family is Mormon and active in the local church.\n\n"}